###################################################################

# Created by write_sdc on Sat Mar 17 12:10:47 2018

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 0.1 [get_ports {OUT[15]}]
set_load -pin_load 0.1 [get_ports {OUT[14]}]
set_load -pin_load 0.1 [get_ports {OUT[13]}]
set_load -pin_load 0.1 [get_ports {OUT[12]}]
set_load -pin_load 0.1 [get_ports {OUT[11]}]
set_load -pin_load 0.1 [get_ports {OUT[10]}]
set_load -pin_load 0.1 [get_ports {OUT[9]}]
set_load -pin_load 0.1 [get_ports {OUT[8]}]
set_load -pin_load 0.1 [get_ports {OUT[7]}]
set_load -pin_load 0.1 [get_ports {OUT[6]}]
set_load -pin_load 0.1 [get_ports {OUT[5]}]
set_load -pin_load 0.1 [get_ports {OUT[4]}]
set_load -pin_load 0.1 [get_ports {OUT[3]}]
set_load -pin_load 0.1 [get_ports {OUT[2]}]
set_load -pin_load 0.1 [get_ports {OUT[1]}]
set_load -pin_load 0.1 [get_ports {OUT[0]}]
set_max_fanout 6 [get_ports DCK]
set_max_fanout 6 [get_ports DAI]
set_max_fanout 6 [get_ports DEN]
set_max_fanout 6 [get_ports GCK]
set_max_fanout 6 [get_ports Vsync]
set_max_fanout 6 [get_ports mode]
set_max_fanout 6 [get_ports rst]
set_ideal_network [get_ports DCK]
set_ideal_network [get_ports GCK]
create_clock [get_ports DCK]  -period 1300  -waveform {0 650}
set_clock_latency 1  [get_clocks DCK]
set_clock_uncertainty 0.1  [get_clocks DCK]
create_clock [get_ports GCK]  -period 4.5  -waveform {0 2.25}
set_clock_latency 1  [get_clocks GCK]
set_clock_uncertainty 0.1  [get_clocks GCK]
set_false_path   -from [get_clocks DCK]  -to [get_clocks GCK]
set_false_path   -from [get_clocks GCK]  -to [get_clocks DCK]
set_input_delay -clock DCK  -max 1  [get_ports DAI]
set_input_delay -clock DCK  -min 0  [get_ports DAI]
set_input_delay -clock DCK  -max 1  [get_ports DEN]
set_input_delay -clock DCK  -min 0  [get_ports DEN]
set_input_delay -clock DCK  -max 1  [get_ports rst]
set_input_delay -clock DCK  -min 0  [get_ports rst]
set_input_delay -clock GCK  -max 1  [get_ports Vsync]
set_input_delay -clock GCK  -min 0  [get_ports Vsync]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[15]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[15]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[14]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[14]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[13]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[13]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[12]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[12]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[11]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[11]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[10]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[10]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[9]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[9]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[8]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[8]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[7]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[7]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[6]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[6]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[5]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[5]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[4]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[4]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[3]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[3]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[2]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[2]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[1]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[1]}]
set_output_delay -clock GCK  -max 1  [get_ports {OUT[0]}]
set_output_delay -clock GCK  -min 0  [get_ports {OUT[0]}]
set_drive 0.1  [get_ports DCK]
set_drive 0.1  [get_ports DAI]
set_drive 0.1  [get_ports DEN]
set_drive 0.1  [get_ports GCK]
set_drive 0.1  [get_ports Vsync]
set_drive 0.1  [get_ports mode]
set_drive 0.1  [get_ports rst]
